export const timelineData = [
    {
      year: '1941',
      summary: 'Начало войны и героическая оборона советских городов',
      events: [
        {
          date: '22 июня 1941',
          title: 'Начало Великой Отечественной войны',
          description: 'В 4 часа утра 22 июня 1941 года фашистская Германия без объявления войны напала на Советский Союз. Начались ожесточённые бои вдоль всей западной границы страны. Авианалёты и артобстрелы стали предвестниками затяжной и кровопролитной войны. С этого дня началась Великая Отечественная война — народная борьба за свободу и независимость.',
          location: 'Вся Государственная граница СССР',
          image: 'https://avatars.mds.yandex.net/i?id=1d245ed3615436e2af5b4f3ac37b83bf5182af43-5287696-images-thumbs&n=13',
          icon: 'battle'
        },
        {
          date: 'Сентябрь 1941 года - Апрель 1942 года',
          title: 'Битва за Москву',
          description: 'Битва за Москву — первое решающее сражение Великой Отечественной войны. Столица СССР имела стратегическое значение: от результата сражения за Москву зависел исход войны. При защите главного города нашей Родины тысячи бойцов и командиров проявили невиданный героизм. Начав осенью 1941 года поход на Москву при подавляющем преимуществе в войсках и технике, немецкие полчища были разбиты и отброшены. Весь мир увидел, что Красная Армия не сломлена, она способна побеждать. Советские люди воспрянули духом.',
          location: 'Москва',
          image: 'https://avatars.mds.yandex.net/i?id=bdc500235901bc441955308bc0ca8ace72385935-5884061-images-thumbs&n=13',
          icon: 'battle'
        },
        {
          date: 'Сентябрь 1941 - Январь 1944',
          title: 'Оборона Ленинграда',
          description: 'Блокада Ленинграда началась 8 сентября 1941 года. В планах гитлеровских оккупантов было стереть с лица земли город и уничтожить всех его жителей. Осаждённый Ленинград 872 дня боролся за жизнь. Ежедневные бомбардировки и страшный голод не сломили ленинградцев, они продолжали жить и бороться. Оборона Северной столицы и её блокада преподнесли беспрецедентный урок стойкости и мужества не только нашей стране, но и всему миру. Ленинград был окончательно освобождён от блокады 27 января 1944 года.',
          location: 'Ленинград',
          image: 'https://avatars.mds.yandex.net/i?id=38ef60c805d85d52ef86b02868283fd48f0a8371-4885656-images-thumbs&n=13',
          icon: 'battle'
        },

      ]
    },
    {
      year: '1942',
      summary: '1942 год стал тяжёлым испытанием для Советского Союза: враг продвигался к Волге и Кавказу. Однако начавшаяся Сталинградская битва положила начало будущему перелому в войне.',
      events: [
        {
          date: 'Июль 1942 - Февраль 1943',
          title: 'Сталинградская битва',
          description: 'Летом 1942 года началась невиданная по своему значению, размаху и напряжению битва на подступах к Дону и Волге. 200 дней и ночей Красная Армия перемалывала отборные соединения Германии и её союзников. Сталинградская битва, которая изменила историю и переломила ход всей Второй мировой войны, продлилась с 17 июля 1942 года по 2 февраля 1943 года и закончилась полной победой советских войск. Оборонительный этап операции продолжался до 18 ноября 1942 года, а с 19 ноября начался наступательный этап.',
          location: 'Сталинград',
          image: 'https://avatars.mds.yandex.net/i?id=b3541064e9428a88de0d7dd5001b2730_l-8178604-images-thumbs&n=13',
          icon: 'battle'
        },
        {
          date: 'Октябрь 1941 — Июль 1942',
          title: 'Оборона Севастополя',
          description: 'Севастополь — город русской славы. Во время Крымской войны XIX века наши воины обороняли главную военно-морскую базу Черноморского флота 349 дней. В годы Великой Отечественной Севастополь держался 250 дней и ночей (с 30 октября 1941 года по 4 июля 1942 года). В обоих случаях защитникам города противостояли превосходящие силы врага: в Крымскую войну — англичане, французы, турки, сардинцы, в 1941–1942 годах — отборные соединения 11-й немецкой армии Эриха фон Манштейна и румынские дивизии.',
          location: 'Севастополь',
          image: 'https://avatars.mds.yandex.net/i?id=0058da3a0b9165f0c21f904ca00ecd4ec40b08b8-5661753-images-thumbs&n=13',
          icon: 'battle'
        },
        {
          date: '12–29 мая 1942',
          title: 'Харьковская операция',
          description: 'Советское командование предприняло наступательную операцию с целью освободить Харьков, но немецкие войска перехватили инициативу и окружили значительные силы Красной армии. В результате сражения советские войска понесли тяжёлые потери, и город остался под контролем вермахта. Битва стала одним из крупнейших поражений РККА в 1942 году. Тем не менее, полученный опыт сыграл роль в подготовке к будущим успешным операциям.',
          location: 'Харьков',
          image: 'https://avatars.mds.yandex.net/i?id=b89210f05403ee9f19051a5197ffdc8a3ba5e5eb-12588376-images-thumbs&n=13',
          icon: 'battle'
        }
      ]
    },
    {
      year: '1943',
      summary: 'В 1943 году обозначился коренным переломом в ходе войны. Победы под Сталинградом и на Курской дуге позволили Красной армии перейти в стратегическое наступление.',
      events: [
        {
          date: 'Июль 1943 - Август 1943',
          title: 'Курская битва',
          description: 'Важнейшим событием всей Великой Отечественной войны стала битва на Курской дуге летом 1943 года. Планы командования вермахта окружить и уничтожить советские войска на Курском выступе были разрушены. Красная Армия сама перешла в контрнаступление и нанесла тяжёлое поражение противнику. Курскую битву многие историки считают завершением коренного перелома в войне.',
          location: 'Сталинград',
          image: 'https://avatars.dzeninfra.ru/get-zen_doc/271828/pub_6516561e1e1438150b743664_6516600576af33463696bc3f/scale_2400',
          icon: 'battle'
        },
        {
          date: '12 июля 1943',
          title: 'Сражение под Прохоровкой',
          description: 'Одна из крупнейших танковых битв в истории, произошедшая в ходе Курской битвы. В ожесточённом бою сошлись советские и немецкие танковые соединения, столкновение носило фронтальный характер и происходило на ограниченном пространстве. Битва завершилась срывом немецкого наступления и стала символом героизма Красной армии. Сражение под Прохоровкой стало переломным моментом всей Курской операции.',
          location: 'Прохоровка, Белгородская область',
          image: 'https://avatars.mds.yandex.net/i?id=193c54e9d1396b3a1571854aa94b0bea192e6cba-4569110-images-thumbs&n=13',
          icon: 'battle'
        },
        {
          date: '6 ноября 1943',
          title: 'Освобождение Киева',
          description: 'В результате успешной наступательной операции войска Красной армии освободили столицу Украины — Киев — от немецко-фашистских захватчиков. Сражения сопровождались тяжёлыми боями при форсировании Днепра и прорыве обороны противника. Победа имела большое стратегическое и моральное значение. Освобождение Киева стало важным этапом в освобождении Правобережной Украины.',
          location: 'Киев, Украина',
          image: 'https://avatars.mds.yandex.net/i?id=a4f5e21eebed176abd7a963a78acd6a47eb3eaf6-2573615-images-thumbs&n=13',
          icon: 'liberation'
        }
        
      ]
    },
    {
      year: '1944',
      summary: 'В 1944 году Красная армия освободила территорию Советского Союза от немецко-фашистских захватчиков. Советские войска перешли границу СССР и начали освобождение стран Восточной Европы.',
      events: [
        {
          date: '27 января 1944',
          title: 'Снятие блокады Ленинграда',
          description: 'После почти 900 дней осады советские войска окончательно прорвали вражеское кольцо вокруг Ленинграда. Блокада, унёсшая сотни тысяч жизней, была полностью снята. Это стало огромной моральной победой для всего советского народа. Город выстоял благодаря мужеству его жителей и защитников.',
          location: 'Ленинград (ныне Санкт-Петербург)',
          image: 'https://avatars.mds.yandex.net/i?id=b50b65719cc6bf35b93b31aa47d4590040ffd0af-5232825-images-thumbs&n=13',
          icon: 'liberation'
        },
        {
          date: '8 апреля — 12 мая 1944',
          title: 'Крымская операция',
          description: 'В ходе Крымской наступательной операции Красная армия освободила полуостров от немецко-румынских войск. Были взяты Симферополь, Керчь, Ялта и Севастополь. Противник понёс крупные потери, а часть его войск эвакуировалась морем. Это стало завершением многомесячной борьбы за Крым.',
          location: 'Крым',
          image: 'https://avatars.mds.yandex.net/i?id=6d5a29611081340eae68c9531f2f872cdcdf842abc70e400-10188656-images-thumbs&n=13',
          icon: 'liberation'
        },
        {
          date: '23 июня — 29 августа 1944',
          title: 'Операция «Багратион»',
          description: 'Масштабное наступление Красной армии на центральном участке фронта. В ходе операции была уничтожена группа армий «Центр» вермахта и полностью освобождена территория Белоруссии. Советские войска продвинулись на сотни километров и вошли в Польшу и Литву. Это стало одной из крупнейших побед СССР в войне.',
          location: 'Белоруссия, часть Польши и Литвы',
          image: 'https://avatars.mds.yandex.net/i?id=ad947d15b7b85947499072453c7b75b72e9df198-4569040-images-thumbs&n=13',
          icon: 'victory'
        }
         
      ]
    },
    {
      year: '1945',
      summary: 'В 1945 году Красная армия провела завершающее наступление, завершившееся штурмом Берлина и капитуляцией нацистской Германии. Великая Отечественная война завершилась Победой советского народа.',
      events: [
        {
          date: '16 апреля — 2 мая 1945',
          title: 'Берлинская операция',
          description: 'Заключительное сражение Великой Отечественной войны. Советские войска начали штурм Берлина 16 апреля и после ожесточённых уличных боёв взяли город. В результате был разгромлен главный оплот нацистской Германии. 2 мая гарнизон Берлина капитулировал.',
          location: 'Берлин, Германия',
          image: 'https://avatars.mds.yandex.net/i?id=119c829a0ca959f86f217a9bf10890150fd5a381-12753080-images-thumbs&n=13',
          icon: 'battle'
        },
        {
          date: '16 марта — 15 апреля 1945',
          title: 'Венская операция',
          description: 'Красная армия провела успешное наступление на южном направлении и освободила Австрию от немецких войск. Бои за Вену велись в тяжёлых городских условиях. Вена была взята 13 апреля, а операция завершилась 15 апреля. Победа усилила позиции СССР в Центральной Европе.',
          location: 'Вена, Австрия',
          image: 'https://avatars.mds.yandex.net/i?id=5d41402d1a722a30de78e3732c7dcf63e7df550b-5239568-images-thumbs&n=13',
          icon: 'liberation'
        },
        {
          date: '16 марта — 15 апреля 1945',
          title: 'Венская операция',
          description: 'Красная армия провела успешное наступление на южном направлении и освободила Австрию от немецких войск. Бои за Вену велись в тяжёлых городских условиях. Вена была взята 13 апреля, а операция завершилась 15 апреля. Победа усилила позиции СССР в Центральной Европе.',
          location: 'Вена, Австрия',
          image: 'https://avatars.mds.yandex.net/i?id=e27b9b809305e6d0eca6d186fd375cd7588c1c7d-5886792-images-thumbs&n=13',
          icon: 'liberation'
        }
      ]
    }
  ];
  